{
  "_name_or_path": "seara/rubert-tiny2-russian-sentiment",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "\u0417\u0434\u043e\u0440\u043e\u0432\u044c\u0435 \u0438 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0430",
    "1": "\u041a\u0443\u043b\u044c\u0442\u0443\u0440\u0430 \u0438 \u0440\u0430\u0437\u0432\u043b\u0435\u0447\u0435\u043d\u0438\u044f",
    "2": "\u041b\u043e\u043a\u0430\u043b\u044c\u043d\u044b\u0435 \u043d\u043e\u0432\u043e\u0441\u0442\u0438",
    "3": "\u041c\u0435\u0442\u0435\u043e\u0440\u043e\u043b\u043e\u0433\u0438\u044f",
    "4": "\u041e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435",
    "5": "\u041e\u0431\u0449\u0435\u0441\u0442\u0432\u043e",
    "6": "\u041f\u043e\u043b\u0438\u0442\u0438\u043a\u0430",
    "7": "\u041f\u0440\u043e\u0438\u0441\u0448\u0435\u0441\u0442\u0432\u0438\u044f \u0438 \u043a\u0440\u0438\u043c\u0438\u043d\u0430\u043b",
    "8": "\u0421\u043f\u043e\u0440\u0442",
    "9": "\u0422\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0438\u0438 \u0438 \u043d\u0430\u0443\u043a\u0430",
    "10": "\u042d\u043a\u043e\u043d\u043e\u043c\u0438\u043a\u0430 \u0438 \u0431\u0438\u0437\u043d\u0435\u0441"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "\u0417\u0434\u043e\u0440\u043e\u0432\u044c\u0435 \u0438 \u043c\u0435\u0434\u0438\u0446\u0438\u043d\u0430": 0,
    "\u041a\u0443\u043b\u044c\u0442\u0443\u0440\u0430 \u0438 \u0440\u0430\u0437\u0432\u043b\u0435\u0447\u0435\u043d\u0438\u044f": 1,
    "\u041b\u043e\u043a\u0430\u043b\u044c\u043d\u044b\u0435 \u043d\u043e\u0432\u043e\u0441\u0442\u0438": 2,
    "\u041c\u0435\u0442\u0435\u043e\u0440\u043e\u043b\u043e\u0433\u0438\u044f": 3,
    "\u041e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435": 4,
    "\u041e\u0431\u0449\u0435\u0441\u0442\u0432\u043e": 5,
    "\u041f\u043e\u043b\u0438\u0442\u0438\u043a\u0430": 6,
    "\u041f\u0440\u043e\u0438\u0441\u0448\u0435\u0441\u0442\u0432\u0438\u044f \u0438 \u043a\u0440\u0438\u043c\u0438\u043d\u0430\u043b": 7,
    "\u0421\u043f\u043e\u0440\u0442": 8,
    "\u0422\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0438\u0438 \u0438 \u043d\u0430\u0443\u043a\u0430": 9,
    "\u042d\u043a\u043e\u043d\u043e\u043c\u0438\u043a\u0430 \u0438 \u0431\u0438\u0437\u043d\u0435\u0441": 10
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 83828
}
